
import { z } from 'zod';

export const userRoleSchema = () => {
    return z.object({
        titleFA: z
            .string({ required_error: "پر کردن فیلد نام فارسی نقش اجباری است." })
            .min(2, { message: "فیلد نام فارسی نقش  کاربری حداقل باید دارای 2 کاراکتر باشد" })
            .max(20, { message: "فیلد نام فارسی نقش  کاربری حداکثر باید 20 کاراکتر داشته باشد." }),
        titleEN: z
            .string({ required_error: "پر کردن فیلد نام انگلیسی نقش  انگلیسی نقش اجباری است." })
            .min(2, { message: "فیلد نام انگلیسی نقش  محصول حداقل باید دارای 2 کاراکتر باشد" })
            .max(20, { message: "فیلد نام انگلیسی نقش  محصول حداکثر باید 20 کاراکتر داشته باشد." }),
    });
};
